bash-tutorial.org
#+TITLE:     Bash Tutorial
#+AUTHOR:    Dhyan Raj
#+EMAIL:     dhyan.raj@synechron.com
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: num:0 whn:2 toc:3 H:6 ^:nil
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style> p{max-width:1800px;}</style>
#+HTML_HEAD: <style> li{max-width:800px;}</style>
#+HTML_HEAD: <style> #table-of-contents{overflow:hidden;}</style>
#+HTML_HEAD: <style> pre.src:hover:before {display:none;}</style>
#+PROPERTY: header-args :exports both
#+INCLUDE: code.inc
#+CALL: init()

* Introduction
** Background
*GNU Bash* or simply *Bash* is a Unix shell and command language written by Brian Fox for the GNU Project as a free software replacement for the Bourne shell. Bash has many high-level language. Along with other powerful Linux tools and external programs, we can write very capable programs in Bash script.
* Variables
** Simple usage
#+begin_src shell :results scalar
name=Dhyan
age=39

echo Hello $name, you dont look like $age
#+end_src

#+RESULTS:
#+begin_example
Hello Dhyan, you dont look like 39
#+end_example
** Inline usage
#+begin_src shell :results scalar
i=10

echo The code is e$ib   # Gives wrong output
echo The code is e${i}b # Correct output
#+end_src

#+RESULTS:
#+begin_example
The code is e
The code is e10b
#+end_example
** Arithmetic Operations on variables 
#+begin_src shell
a=1
b=2

echo $(( a + b ))
#+end_src

#+RESULTS:
#+begin_example
3
#+end_example
** Increment variable
#+begin_src shell
i=1

let "i=i+1"
echo $i

let "i+=1"
echo $i

let "i++"
echo $i
#+end_src

#+RESULTS:
| 2 |
| 3 |
| 4 |

* Arrays
** Single Dimensional Arrays
*** Declaration 
#+begin_src shell :results verbatim
arr=(Bash "is simple" yet powerful )
echo ${arr[0]}
echo ${arr[1]}
#+end_src

#+RESULTS:
#+begin_example
Bash
is simple
#+end_example
*** Array Length
#+begin_src shell :results verbatim

arr=(Bash "is simple" yet powerful )

echo "arr has "${#arr[@]}" elements"
#+end_src

#+RESULTS:
#+begin_example
arr has 4 elements
#+end_example

** Multi Dimensional Arrays
#+begin_src shell
declare -A aa
aa[shell]=Bash
aa[editor]=Emacs

echo We are using ${aa[shell]} in this tutorial and is generated with ${aa[editor]}
#+end_src

#+RESULTS:
#+begin_example
We are using Bash in this tutorial and is generated with Emacs
#+end_example

* Bash Script parameters
** Passing parameters to Bash scripts
It is possible to pass multiple parameters to a Bash script. The parameters are accessible inside script as $1, $2, $3 etc. 
#+begin_src shell :results verbatim
cat lib/bash_parameters_test_1.sh 
#+end_src

#+RESULTS:
#+begin_example
#!/bin/bash

echo First Parameter $1
echo Second Parameter $2
echo Third Parameter $3
#+end_example

#+begin_src shell :results verbatim
lib/bash_parameters_test_1.sh Hello World
#+end_src

#+RESULTS:
#+begin_example
First Parameter Hello
Second Parameter World
Third Parameter
#+end_example

#+begin_note
Use $0 to access the name of the script
#+end_note

** Accessing all parameters
Use $@ to access all parameters
#+begin_src shell :results verbatim
cat lib/bash_parameters_test_2.sh 
#+end_src

#+RESULTS:
#+begin_example
#!/bin/bash

echo All Parameters passed to this script are $@
#+end_example

#+begin_src shell :results verbatim
lib/bash_parameters_test_2.sh We can send many parameters to bash script and access them using '$@'
#+end_src

#+RESULTS:
#+begin_example
All Parameters passed to this script are We can send many parameters to bash script and access them using $@
#+end_example

#+begin_note
Use $@ in for loop to iterate through each parameter

#+begin_src shell
for i in $@; do
    echo $i
done

#+end_src
#+end_note


* Control Statements
** If 
