bash-tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-05 Thu 13:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash Tutorial</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dhyan Raj" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Bash Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga457d8b">Introduction</a>
<ul>
<li><a href="#org38ed066">Background</a></li>
</ul>
</li>
<li><a href="#org409fc75">Variables</a>
<ul>
<li><a href="#org30662cb">Simple usage</a></li>
<li><a href="#orgeed1674">Inline usage</a></li>
<li><a href="#org4fb680f">Arithmetic Operations on variables</a></li>
<li><a href="#orgc82b4f9">Increment variable</a></li>
</ul>
</li>
<li><a href="#org7abe8de">Arrays</a>
<ul>
<li><a href="#orgb536650">Single Dimensional Arrays</a></li>
<li><a href="#org44a6388">Multi Dimensional Arrays</a></li>
</ul>
</li>
<li><a href="#org02c6711">Bash Script parameters</a>
<ul>
<li><a href="#orge5793cf">Passing parameters to Bash scripts</a></li>
<li><a href="#orgac71ba5">Accessing all parameters</a></li>
</ul>
</li>
<li><a href="#org1c2b7b2">Control Statements</a>
<ul>
<li><a href="#org3a860ab">If</a>
<ul>
<li><a href="#orgc95bdb8">Simple If</a></li>
<li><a href="#orgd981314">If..Else</a></li>
<li><a href="#org29a73e6">If..Else if..Else</a></li>
<li><a href="#org14c3de8">if file exists</a></li>
<li><a href="#org044db0c">if directory exists</a></li>
</ul>
</li>
<li><a href="#orgf3e7178">Conditional Operators</a>
<ul>
<li><a href="#orgc6a37c0">Example</a></li>
<li><a href="#org4335dc8">List of Operators</a></li>
</ul>
</li>
<li><a href="#org1f206e7">For loop</a></li>
</ul>
</li>
<li><a href="#org5298171">Functions</a>
<ul>
<li><a href="#org9493579">Simple Function Declarations</a></li>
<li><a href="#org8a14445">Function calls</a></li>
<li><a href="#orgc241f9f">Function calls with parameters</a></li>
</ul>
</li>
<li><a href="#org60ad9c4">Built-In Utilities</a>
<ul>
<li><a href="#org51e70d9">Sequence generator</a>
<ul>
<li><a href="#org7ca1f80">seq</a></li>
<li><a href="#orgf2e756c">seq with fixed width</a></li>
<li><a href="#org3a86a73">Looping with seq</a></li>
<li><a href="#orge20793c">Looping with seq and interval</a></li>
<li><a href="#orgf8acfae">Multi-Loops with seq and interval</a></li>
</ul>
</li>
<li><a href="#org52c0522">Date</a>
<ul>
<li><a href="#org38347ab">Seconds since Epoch</a></li>
<li><a href="#org9816453">Time elapsed</a></li>
<li><a href="#orge205fe1">Formatting time</a></li>
</ul>
</li>
<li><a href="#org77a65a3">PID</a>
<ul>
<li><a href="#org6abe8f1">PID of most recently executed background job</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7ead081">External Utilities</a>
<ul>
<li><a href="#org1acd077">Curl</a>
<ul>
<li><a href="#org20efc0b">Ignore SSL</a></li>
<li><a href="#org99f718c">Get HTTP Status code</a></li>
</ul>
</li>
<li><a href="#org2e91881">SED</a>
<ul>
<li><a href="#orgf687a77">Replace String</a></li>
</ul>
</li>
<li><a href="#orgb573868">JQ</a></li>
<li><a href="#org9ad5b66">XARGS</a></li>
<li><a href="#org6efb2ab">TEE</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga457d8b" class="outline-2">
<h2 id="orga457d8b">Introduction</h2>
<div class="outline-text-2" id="text-orga457d8b">
</div>
<div id="outline-container-org38ed066" class="outline-3">
<h3 id="org38ed066">Background</h3>
<div class="outline-text-3" id="text-org38ed066">
<p>
<b>GNU Bash</b> or simply <b>Bash</b> is a Unix shell and command language written by Brian Fox for the GNU Project as a free software replacement for the Bourne shell. Bash has many high-level language. Along with other powerful Linux tools and external programs, we can write very capable programs in Bash script.
</p>
</div>
</div>
</div>
<div id="outline-container-org409fc75" class="outline-2">
<h2 id="org409fc75">Variables</h2>
<div class="outline-text-2" id="text-org409fc75">
</div>
<div id="outline-container-org30662cb" class="outline-3">
<h3 id="org30662cb">Simple usage</h3>
<div class="outline-text-3" id="text-org30662cb">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">name</span>=Dhyan
<span class="org-variable-name">age</span>=39

<span class="org-builtin">echo</span> Hello $<span class="org-variable-name">name</span>, you dont look like $<span class="org-variable-name">age</span>
</pre>
</div>

<pre class="example">
Hello Dhyan, you dont look like 39
</pre>
</div>
</div>
<div id="outline-container-orgeed1674" class="outline-3">
<h3 id="orgeed1674">Inline usage</h3>
<div class="outline-text-3" id="text-orgeed1674">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">i</span>=10

<span class="org-builtin">echo</span> The code is e$<span class="org-variable-name">ib</span>   <span class="org-comment-delimiter"># </span><span class="org-comment">Gives wrong output</span>
<span class="org-builtin">echo</span> The code is e${<span class="org-variable-name">i</span>}b <span class="org-comment-delimiter"># </span><span class="org-comment">Correct output</span>
</pre>
</div>

<pre class="example">
The code is e
The code is e10b
</pre>
</div>
</div>
<div id="outline-container-org4fb680f" class="outline-3">
<h3 id="org4fb680f">Arithmetic Operations on variables</h3>
<div class="outline-text-3" id="text-org4fb680f">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">a</span>=1
<span class="org-variable-name">b</span>=2

<span class="org-builtin">echo</span> $(( a + b ))
</pre>
</div>

<pre class="example">
3
</pre>
</div>
</div>
<div id="outline-container-orgc82b4f9" class="outline-3">
<h3 id="orgc82b4f9">Increment variable</h3>
<div class="outline-text-3" id="text-orgc82b4f9">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">i</span>=1

<span class="org-builtin">let</span> <span class="org-string">"i=i+1"</span>
<span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>

<span class="org-builtin">let</span> <span class="org-string">"i+=1"</span>
<span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>

<span class="org-builtin">let</span> <span class="org-string">"i++"</span>
<span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org7abe8de" class="outline-2">
<h2 id="org7abe8de">Arrays</h2>
<div class="outline-text-2" id="text-org7abe8de">
</div>
<div id="outline-container-orgb536650" class="outline-3">
<h3 id="orgb536650">Single Dimensional Arrays</h3>
<div class="outline-text-3" id="text-orgb536650">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">arr</span>=(Bash <span class="org-string">"is simple"</span> yet powerful )
<span class="org-builtin">echo</span> ${<span class="org-variable-name">arr</span>[0]}
<span class="org-builtin">echo</span> ${<span class="org-variable-name">arr</span>[1]}
</pre>
</div>

<pre class="example">
Bash
is simple
</pre>
</div>
</div>
<div id="outline-container-org44a6388" class="outline-3">
<h3 id="org44a6388">Multi Dimensional Arrays</h3>
<div class="outline-text-3" id="text-org44a6388">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">declare</span> -A aa
<span class="org-variable-name">aa</span>[shell]=Bash

<span class="org-builtin">echo</span> We are using ${<span class="org-variable-name">aa</span>[shell]} <span class="org-keyword">in</span> this example
</pre>
</div>

<pre class="example">
We are using Bash in this example
</pre>
</div>
</div>
</div>

<div id="outline-container-org02c6711" class="outline-2">
<h2 id="org02c6711">Bash Script parameters</h2>
<div class="outline-text-2" id="text-org02c6711">
</div>
<div id="outline-container-orge5793cf" class="outline-3">
<h3 id="orge5793cf">Passing parameters to Bash scripts</h3>
<div class="outline-text-3" id="text-orge5793cf">
<p>
It is possible to pass multiple parameters to a Bash script. The parameters are accessible inside script as $1, $2, $3 etc. 
</p>
<div class="org-src-container">
<pre class="src src-shell">cat lib/bash_parameters_test_1.sh 
</pre>
</div>

<pre class="example">
#!/bin/bash

echo First Parameter $1
echo Second Parameter $2
echo Third Parameter $3
</pre>

<div class="org-src-container">
<pre class="src src-shell">lib/bash_parameters_test_1.sh Hello World
</pre>
</div>

<pre class="example">
First Parameter Hello
Second Parameter World
Third Parameter
</pre>

<div class="note">
<p>
Use $0 to access the name of the script
</p>

</div>
</div>
</div>

<div id="outline-container-orgac71ba5" class="outline-3">
<h3 id="orgac71ba5">Accessing all parameters</h3>
<div class="outline-text-3" id="text-orgac71ba5">
<p>
Use $@ to access all parameters
</p>
<div class="org-src-container">
<pre class="src src-shell">cat lib/bash_parameters_test_2.sh 
</pre>
</div>

<pre class="example">
#!/bin/bash

echo All Parameters passed to this script are $@
</pre>

<div class="org-src-container">
<pre class="src src-shell">lib/bash_parameters_test_2.sh We can send many parameters to bash script and access them using <span class="org-string">'$@'</span>
</pre>
</div>

<pre class="example">
All Parameters passed to this script are We can send many parameters to bash script and access them using $@
</pre>

<div class="note">
<p>
Use $@ in for loop to iterate through each parameter
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
<span class="org-keyword">done</span>

</pre>
</div>

</div>
</div>
</div>
</div>


<div id="outline-container-org1c2b7b2" class="outline-2">
<h2 id="org1c2b7b2">Control Statements</h2>
<div class="outline-text-2" id="text-org1c2b7b2">
</div>
