bash-tutorial.org
*** Simple If
#+begin_src shell
result=OK

if [ $result == "OK" ]; then
  echo Everything seems to be OK
fi
#+end_src

#+RESULTS:
#+begin_example
Everything seems to be OK
#+end_example

#+begin_src shell
status=200

if [ $status == 200 ]; then
  echo It went well
fi
#+end_src

#+RESULTS:
#+begin_example
It went well
#+end_example
*** If..Else
#+begin_src shell
result=OOPS

if [ $result == "OK" ]; then
  echo Everything seems to be OK
else
  echo Something went wrong
fi
#+end_src

#+RESULTS:
#+begin_example
Something went wrong
#+end_example
*** If..Else if..Else
#+begin_src shell
result=RETRY

if [ $result == "OK" ]; then
  echo Everything seems to be OK
elif [ $result == "RETRY" ]; then
  echo Lets try again
else
  echo Something went wrong
fi
#+end_src

#+RESULTS:
#+begin_example
Lets try again
#+end_example

#+begin_note
else if in *Bash* is =elif=
#+end_note
*** if file exists
#+begin_src shell :results scalar

f=output/test.txt

if [ -f $f ]; then
  cat $f
else 
  echo File doesn\'t exist
fi 

echo "This file is now created" > output/test.txt

if [ -f $f ]; then
  cat $f
else 
  echo File doesn\'t exist
fi 

#+end_src

#+RESULTS:
#+begin_example
File doesn't exist
This file is now created
#+end_example
*** if directory exists
#+begin_src shell :results scalar

f=output/accounts

if [ -d $f ]; then
  echo accounts directory exist
else 
  echo directory doesn\'t exist
fi 

mkdir output/accounts

if [ -d $f ]; then
  echo accounts directory exist
else 
  echo directory doesn\'t exist
fi 

#+end_src

#+RESULTS:
#+begin_example
directory doesn't exist
accounts directory exist
#+end_example
** Conditional Operators
*** Example
#+begin_src shell :results verbatim

marks=85

if [ $marks -ge 80 ]; then
    echo "You passed with distinction"
fi 

#+end_src

#+RESULTS:
#+begin_example
You passed with distinction
#+end_example

#+begin_src shell :results verbatim

age=12

if [ $age -le 15 ]; then
    echo "You can't apply for driver license yet"
fi 

#+end_src

#+RESULTS:
#+begin_example
You can't apply for driver license yet
#+end_example
*** List of Operators
| Operator      | Description                                   |
|---------------+-----------------------------------------------|
| arg1 *-eq* arg2    | True if arg1 equals arg2                      |
| arg1 *-ne* arg2 | True if arg1 is not equal to arg2             |
| arg1 *-lt* arg2 | True if arg1 is less than arg2                |
| arg1 *-le* arg2 | True if arg1 is less than or equal to arg2    |
| arg1 *-gt* arg2 | True if arg1 is greater than arg2             |
| arg1 *-ge* arg2 | True if arg1 is greater than or equal to arg2 |

** For loop
#+begin_src shell
for i in 1 2 3 4 5; do
  echo $i
done
#+end_src

#+RESULTS:
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
#+begin_src shell
for i in {1..10}; do
  echo $i
done
#+end_src

#+RESULTS:
|  1 |
|  2 |
|  3 |
|  4 |
|  5 |
|  6 |
|  7 |
|  8 |
|  9 |
| 10 |
#+begin_src shell
for i in {1..10..2}; do
  echo $i
done
#+end_src

#+RESULTS:
| 1 |
| 3 |
| 5 |
| 7 |
| 9 |
* Functions
Although statements can be written one after another, it would be ideal to group statements into functions or files for understand-ability and manageability. Multiple statements can be grouped in Bash script using the keyword */function/*. Functions can be called with parameters as well. 

# There are two ways to invoke another script
# - Execute the script using . operator (E.g =./another-script.sh=) 
# - Include the script and invoke statements as if they were written in the current script (E.g =source ./another-script.sh=)
** Simple Function Declarations
Statements are executed in the order they are written, but function declarations are not executed unless they are invoked explicitly from other statements.

#+begin_src shell
function aFunction() {
    echo "aFunction is called"
}
#+end_src

#+begin_note
Above statement if executed produces no output since the function aFunction is never invoked from anywhere
#+end_note

** Function calls

#+begin_src shell
function aFunction() {
    echo "aFunction is called"
}

aFunction
#+end_src

#+RESULTS:
#+begin_example
aFunction is called
#+end_example

