bash-tutorial.html
<div id="outline-container-org3a860ab" class="outline-3">
<h3 id="org3a860ab">If</h3>
<div class="outline-text-3" id="text-org3a860ab">
</div>
<div id="outline-container-orgc95bdb8" class="outline-4">
<h4 id="orgc95bdb8">Simple If</h4>
<div class="outline-text-4" id="text-orgc95bdb8">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">result</span>=OK

<span class="org-keyword">if</span> [ $<span class="org-variable-name">result</span> == <span class="org-string">"OK"</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> Everything seems to be OK
<span class="org-keyword">fi</span>
</pre>
</div>

<pre class="example">
Everything seems to be OK
</pre>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">status</span>=200

<span class="org-keyword">if</span> [ $<span class="org-variable-name">status</span> == 200 ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> It went well
<span class="org-keyword">fi</span>
</pre>
</div>

<pre class="example">
It went well
</pre>
</div>
</div>
<div id="outline-container-orgd981314" class="outline-4">
<h4 id="orgd981314">If..Else</h4>
<div class="outline-text-4" id="text-orgd981314">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">result</span>=OOPS

<span class="org-keyword">if</span> [ $<span class="org-variable-name">result</span> == <span class="org-string">"OK"</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> Everything seems to be OK
<span class="org-keyword">else</span>
  <span class="org-builtin">echo</span> Something went wrong
<span class="org-keyword">fi</span>
</pre>
</div>

<pre class="example">
Something went wrong
</pre>
</div>
</div>
<div id="outline-container-org29a73e6" class="outline-4">
<h4 id="org29a73e6">If..Else if..Else</h4>
<div class="outline-text-4" id="text-org29a73e6">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">result</span>=RETRY

<span class="org-keyword">if</span> [ $<span class="org-variable-name">result</span> == <span class="org-string">"OK"</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> Everything seems to be OK
<span class="org-keyword">elif</span> [ $<span class="org-variable-name">result</span> == <span class="org-string">"RETRY"</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> Lets try again
<span class="org-keyword">else</span>
  <span class="org-builtin">echo</span> Something went wrong
<span class="org-keyword">fi</span>
</pre>
</div>

<pre class="example">
Lets try again
</pre>

<div class="note">
<p>
else if in <b>Bash</b> is <code>elif</code>
</p>

</div>
</div>
</div>
<div id="outline-container-org14c3de8" class="outline-4">
<h4 id="org14c3de8">if file exists</h4>
<div class="outline-text-4" id="text-org14c3de8">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">f</span>=output/test.txt

<span class="org-keyword">if</span> [ -f $<span class="org-variable-name">f</span> ]; <span class="org-keyword">then</span>
  cat $<span class="org-variable-name">f</span>
<span class="org-keyword">else</span> 
  <span class="org-builtin">echo</span> File doesn<span class="org-string">\'</span>t exist
<span class="org-keyword">fi</span> 

<span class="org-builtin">echo</span> <span class="org-string">"This file is now created"</span> &gt; output/test.txt

<span class="org-keyword">if</span> [ -f $<span class="org-variable-name">f</span> ]; <span class="org-keyword">then</span>
  cat $<span class="org-variable-name">f</span>
<span class="org-keyword">else</span> 
  <span class="org-builtin">echo</span> File doesn<span class="org-string">\'</span>t exist
<span class="org-keyword">fi</span> 

</pre>
</div>

<pre class="example">
File doesn't exist
This file is now created
</pre>
</div>
</div>
<div id="outline-container-org044db0c" class="outline-4">
<h4 id="org044db0c">if directory exists</h4>
<div class="outline-text-4" id="text-org044db0c">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">f</span>=output/accounts

<span class="org-keyword">if</span> [ -d $<span class="org-variable-name">f</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> accounts directory exist
<span class="org-keyword">else</span> 
  <span class="org-builtin">echo</span> directory doesn<span class="org-string">\'</span>t exist
<span class="org-keyword">fi</span> 

mkdir output/accounts

<span class="org-keyword">if</span> [ -d $<span class="org-variable-name">f</span> ]; <span class="org-keyword">then</span>
  <span class="org-builtin">echo</span> accounts directory exist
<span class="org-keyword">else</span> 
  <span class="org-builtin">echo</span> directory doesn<span class="org-string">\'</span>t exist
<span class="org-keyword">fi</span> 

</pre>
</div>

<pre class="example">
directory doesn't exist
accounts directory exist
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3e7178" class="outline-3">
<h3 id="orgf3e7178">Conditional Operators</h3>
<div class="outline-text-3" id="text-orgf3e7178">
</div>
<div id="outline-container-orgc6a37c0" class="outline-4">
<h4 id="orgc6a37c0">Example</h4>
<div class="outline-text-4" id="text-orgc6a37c0">
<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">marks</span>=85

<span class="org-keyword">if</span> [ $<span class="org-variable-name">marks</span> -ge 80 ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> <span class="org-string">"You passed with distinction"</span>
<span class="org-keyword">fi</span> 

</pre>
</div>

<pre class="example">
You passed with distinction
</pre>

<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">age</span>=12

<span class="org-keyword">if</span> [ $<span class="org-variable-name">age</span> -le 15 ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> <span class="org-string">"You can't apply for driver license yet"</span>
<span class="org-keyword">fi</span> 

</pre>
</div>

<pre class="example">
You can't apply for driver license yet
</pre>
</div>
</div>
<div id="outline-container-org4335dc8" class="outline-4">
<h4 id="org4335dc8">List of Operators</h4>
<div class="outline-text-4" id="text-org4335dc8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">arg1 <b>-eq</b> arg2</td>
<td class="org-left">True if arg1 equals arg2</td>
</tr>

<tr>
<td class="org-left">arg1 <b>-ne</b> arg2</td>
<td class="org-left">True if arg1 is not equal to arg2</td>
</tr>

<tr>
<td class="org-left">arg1 <b>-lt</b> arg2</td>
<td class="org-left">True if arg1 is less than arg2</td>
</tr>

<tr>
<td class="org-left">arg1 <b>-le</b> arg2</td>
<td class="org-left">True if arg1 is less than or equal to arg2</td>
</tr>

<tr>
<td class="org-left">arg1 <b>-gt</b> arg2</td>
<td class="org-left">True if arg1 is greater than arg2</td>
</tr>

<tr>
<td class="org-left">arg1 <b>-ge</b> arg2</td>
<td class="org-left">True if arg1 is greater than or equal to arg2</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org1f206e7" class="outline-3">
<h3 id="org1f206e7">For loop</h3>
<div class="outline-text-3" id="text-org1f206e7">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> 1 2 3 4 5; <span class="org-keyword">do</span>
  <span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
<span class="org-keyword">done</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">5</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> {1..10}; <span class="org-keyword">do</span>
  <span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
<span class="org-keyword">done</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">10</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> {1..10..2}; <span class="org-keyword">do</span>
  <span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
<span class="org-keyword">done</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">9</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org5298171" class="outline-2">
<h2 id="org5298171">Functions</h2>
<div class="outline-text-2" id="text-org5298171">
<p>
Although statements can be written one after another, it would be ideal to group statements into functions or files for understand-ability and manageability. Multiple statements can be grouped in Bash script using the keyword <b><i>function</i></b>. Functions can be called with parameters as well. 
</p>
</div>
<div id="outline-container-org9493579" class="outline-3">
<h3 id="org9493579">Simple Function Declarations</h3>
<div class="outline-text-3" id="text-org9493579">
<p>
Statements are executed in the order they are written, but function declarations are not executed unless they are invoked explicitly from other statements.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">function</span> <span class="org-function-name">aFunction</span>() {
    <span class="org-builtin">echo</span> <span class="org-string">"aFunction is called"</span>
}
</pre>
</div>

<div class="note">
<p>
Above statement if executed produces no output since the function aFunction is never invoked from anywhere
</p>

</div>
</div>
</div>
