bash-tutorial.org
*** Multi-Loops with seq and interval
You can skip some cycles with multiple =seq= in the same loop. 
#+begin_src shell
for i in $(seq 1 5 15; seq 50 10 100); do
   echo $i
done
#+end_src

#+RESULTS:
|   1 |
|   6 |
|  11 |
|  50 |
|  60 |
|  70 |
|  80 |
|  90 |
| 100 |

** Date 
*** Seconds since Epoch 
#+begin_src shell
echo `date +%s`
#+end_src

#+RESULTS:
#+begin_example
1574787849
#+end_example

*** Time elapsed
#+begin_src shell
startTime=$(date +%s)
sleep 2
elapsedTime="$(($(date +%s)-$startTime ))"

echo Was sleeping for $elapsedTime 
#+end_src

#+RESULTS:
#+begin_example
Was sleeping for 2
#+end_example

*** Formatting time
#+begin_src shell
currentTime=$(date +%s)

echo "Current Time: " $(date -d@$currentTime -u +%H:%M:%S)
#+end_src

#+RESULTS:
#+begin_example
Current Time:  17:04:12
#+end_example
** PID
*** PID of most recently executed background job
#+begin_src shell
sleep 2 &
echo $!
#+end_src

#+RESULTS:
#+begin_example
4163
#+end_example

* External Utilities
** Curl
*** Ignore SSL
#+begin_src shell :exports code
curl -k https://yarchive.net
#+end_src

#+RESULTS:
*** Get HTTP Status code
#+begin_src shell
response=$(curl -k -m 1 --write-out %{http_code} --silent --output /dev/null https://www.google.com )

echo $response
#+end_src

#+RESULTS:
#+begin_example
200
#+end_example
** SED
*** Replace String
#+begin_src shell :results verbatim
cat input/application.properties
#+end_src

#+RESULTS:
#+begin_example
/home/dhyan/blockchain/github/dhyansraj.github.io
host=HOST_NAME
port=PORT
application_name=JEDI
#+end_example

#+begin_src shell :results verbatim

PATTERN="s/HOST_NAME/www.google.com/g"
sed $PATTERN input/application.properties
#+end_src

#+RESULTS:
#+begin_example
host=www.google.com
port=PORT
application_name=JEDI
#+end_example

** JQ
*TODO*
** XARGS
*TODO*
** TEE
