bash-tutorial.html

<div id="outline-container-orgf8acfae" class="outline-4">
<h4 id="orgf8acfae">Multi-Loops with seq and interval</h4>
<div class="outline-text-4" id="text-orgf8acfae">
<p>
You can skip some cycles with multiple <code>seq</code> in the same loop. 
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> i<span class="org-keyword"> in</span> $(<span class="org-sh-quoted-exec">seq</span> 1 5 15; seq 50 10 100); <span class="org-keyword">do</span>
   <span class="org-builtin">echo</span> $<span class="org-variable-name">i</span>
<span class="org-keyword">done</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-right">50</td>
</tr>

<tr>
<td class="org-right">60</td>
</tr>

<tr>
<td class="org-right">70</td>
</tr>

<tr>
<td class="org-right">80</td>
</tr>

<tr>
<td class="org-right">90</td>
</tr>

<tr>
<td class="org-right">100</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org52c0522" class="outline-3">
<h3 id="org52c0522">Date</h3>
<div class="outline-text-3" id="text-org52c0522">
</div>
<div id="outline-container-org38347ab" class="outline-4">
<h4 id="org38347ab">Seconds since Epoch</h4>
<div class="outline-text-4" id="text-org38347ab">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">echo</span> <span class="org-sh-quoted-exec">`date +%s`</span>
</pre>
</div>

<pre class="example">
1575570806
</pre>
</div>
</div>

<div id="outline-container-org9816453" class="outline-4">
<h4 id="org9816453">Time elapsed</h4>
<div class="outline-text-4" id="text-org9816453">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">startTime</span>=$(<span class="org-sh-quoted-exec">date</span> +%s)
sleep 2
<span class="org-variable-name">elapsedTime</span>=<span class="org-string">"$(($(</span><span class="org-sh-quoted-exec">date</span><span class="org-string"> +%s)-$startTime ))"</span>

<span class="org-builtin">echo</span> Was sleeping for $<span class="org-variable-name">elapsedTime</span> 
</pre>
</div>

<pre class="example">
Was sleeping for 2
</pre>
</div>
</div>

<div id="outline-container-orge205fe1" class="outline-4">
<h4 id="orge205fe1">Formatting time</h4>
<div class="outline-text-4" id="text-orge205fe1">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">currentTime</span>=$(<span class="org-sh-quoted-exec">date</span> +%s)

<span class="org-builtin">echo</span> <span class="org-string">"Current Time: "</span> $(<span class="org-sh-quoted-exec">date</span> -d@$<span class="org-variable-name">currentTime</span> -u +%H:%M:%S)
</pre>
</div>

<pre class="example">
Current Time:  18:33:28
</pre>
</div>
</div>
</div>
<div id="outline-container-org77a65a3" class="outline-3">
<h3 id="org77a65a3">PID</h3>
<div class="outline-text-3" id="text-org77a65a3">
</div>
<div id="outline-container-org6abe8f1" class="outline-4">
<h4 id="org6abe8f1">PID of most recently executed background job</h4>
<div class="outline-text-4" id="text-org6abe8f1">
<div class="org-src-container">
<pre class="src src-shell">sleep 2 &amp;
<span class="org-builtin">echo</span> $<span class="org-variable-name">!</span>
</pre>
</div>

<pre class="example">
5710
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ead081" class="outline-2">
<h2 id="org7ead081">External Utilities</h2>
<div class="outline-text-2" id="text-org7ead081">
</div>
<div id="outline-container-org1acd077" class="outline-3">
<h3 id="org1acd077">Curl</h3>
<div class="outline-text-3" id="text-org1acd077">
</div>
<div id="outline-container-org20efc0b" class="outline-4">
<h4 id="org20efc0b">Ignore SSL</h4>
<div class="outline-text-4" id="text-org20efc0b">
<div class="org-src-container">
<pre class="src src-shell">curl -k https://yarchive.net
</pre>
</div>
</div>
</div>
<div id="outline-container-org99f718c" class="outline-4">
<h4 id="org99f718c">Get HTTP Status code</h4>
<div class="outline-text-4" id="text-org99f718c">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-variable-name">response</span>=$(<span class="org-sh-quoted-exec">curl</span> -k -m 1 --write-out %{http_code} --silent --output /dev/null https://www.google.com )

<span class="org-builtin">echo</span> $<span class="org-variable-name">response</span>
</pre>
</div>

<pre class="example">
200
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e91881" class="outline-3">
<h3 id="org2e91881">SED</h3>
<div class="outline-text-3" id="text-org2e91881">
</div>
<div id="outline-container-orgf687a77" class="outline-4">
<h4 id="orgf687a77">Replace String</h4>
<div class="outline-text-4" id="text-orgf687a77">
<div class="org-src-container">
<pre class="src src-shell">cat input/application.properties
</pre>
</div>

<pre class="example">
host=HOST_NAME
port=PORT
application_name=JEDI
</pre>

<div class="org-src-container">
<pre class="src src-shell">
<span class="org-variable-name">PATTERN</span>=<span class="org-string">"s/HOST_NAME/www.google.com/g"</span>
sed $<span class="org-variable-name">PATTERN</span> input/application.properties
</pre>
</div>

<pre class="example">
host=www.google.com
port=PORT
application_name=JEDI
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb573868" class="outline-3">
<h3 id="orgb573868">JQ</h3>
<div class="outline-text-3" id="text-orgb573868">
<p>
<b>TODO</b>
</p>
</div>
</div>
<div id="outline-container-org9ad5b66" class="outline-3">
<h3 id="org9ad5b66">XARGS</h3>
<div class="outline-text-3" id="text-org9ad5b66">
<p>
<b>TODO</b>
</p>
</div>
</div>
<div id="outline-container-org6efb2ab" class="outline-3">
<h3 id="org6efb2ab">TEE</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dhyan Raj</p>
<p class="date">Created: 2019-12-05 Thu 13:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
